Ran Plan for dir: `new-product-test` workspace: `default`

<details><summary>Show Output</summary>

```diff
Initializing the backend...
Initializing modules...
- my-first-config in my-first-config
- my-first-config.my-flags in my-first-config/flags

Initializing provider plugins...
- Finding configcat/configcat versions matching "~> 5.0"...
- Installing configcat/configcat v5.5.7...
- Installed configcat/configcat v5.5.7 (self-signed, key ID 7C7CA631F7D7DAD7)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

data.configcat_organizations.my_organizations: Reading...
data.configcat_organizations.my_organizations: Read complete after 0s [id=1756491149]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # configcat_environment.forno_environment will be created
  + resource "configcat_environment" "forno_environment" {
      + color       = (known after apply)
      + description = "Forno environment for New Product Test"
      + id          = (known after apply)
      + name        = "Forno"
      + order       = 1
      + product_id  = (known after apply)
    }

  # configcat_environment.prod_environment will be created
  + resource "configcat_environment" "prod_environment" {
      + color       = (known after apply)
      + description = "Production environment for New Product Test"
      + id          = (known after apply)
      + name        = "Production"
      + order       = 0
      + product_id  = (known after apply)
    }

  # configcat_environment.staging_environment will be created
  + resource "configcat_environment" "staging_environment" {
      + color       = (known after apply)
      + description = "Staging environment for New Product Test"
      + id          = (known after apply)
      + name        = "Staging"
      + order       = 2
      + product_id  = (known after apply)
    }

  # configcat_product.my_product will be created
  + resource "configcat_product" "my_product" {
      + description     = "New Product Test Description"
      + id              = (known after apply)
      + name            = "New Product Test"
      + order           = 0
      + organization_id = "08dde66c-13ee-4775-8d51-b2bc53deb2da"
    }

  # module.my-first-config.configcat_config.my_config will be created
  + resource "configcat_config" "my_config" {
      + description        = "My First Config Description"
      + evaluation_version = "v2"
      + id                 = (known after apply)
      + name               = "My First Config"
      + order              = 0
      + product_id         = (known after apply)
    }

  # module.my-first-config.module.my-flags.configcat_setting.my_first_flag will be created
  + resource "configcat_setting" "my_first_flag" {
      + config_id    = (known after apply)
      + hint         = (known after apply)
      + id           = (known after apply)
      + key          = "MyFirstFlag"
      + name         = "My First Flag"
      + order        = 0
      + setting_type = "boolean"
    }

  # module.my-first-config.module.my-flags.configcat_setting_value_v2.my_first_flag_value_forno will be created
  + resource "configcat_setting_value_v2" "my_first_flag_value_forno" {
      + environment_id  = (known after apply)
      + id              = (known after apply)
      + init_only       = true
      + mandatory_notes = jsonencode(
            {
              + active      = true
              + expiry_date = "2024-12-31"
              + owner       = "qa-team"
              + priority    = "high"
            }
        )
      + setting_id      = (known after apply)
      + setting_type    = (known after apply)
      + value           = {
          + bool_value = false
        }
    }

  # module.my-first-config.module.my-flags.configcat_setting_value_v2.my_first_flag_value_prod will be created
  + resource "configcat_setting_value_v2" "my_first_flag_value_prod" {
      + environment_id  = (known after apply)
      + id              = (known after apply)
      + init_only       = true
      + mandatory_notes = jsonencode(
            {
              + active      = true
              + expiry_date = "2024-12-31"
              + owner       = "qa-team"
              + priority    = "high"
            }
        )
      + setting_id      = (known after apply)
      + setting_type    = (known after apply)
      + value           = {
          + bool_value = false
        }
    }

  # module.my-first-config.module.my-flags.configcat_setting_value_v2.my_first_flag_value_staging will be created
  + resource "configcat_setting_value_v2" "my_first_flag_value_staging" {
      + environment_id = (known after apply)
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = {
          + bool_value = false
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + forno_environment_name   = "Forno"
  + prod_environment_name    = "Production"
  + product_name             = "New Product Test"
  + staging_environment_name = "Staging"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d new-product-test
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fnew-product-test%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d new-product-test
  ```
Plan: 9 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```